models/user/UserRecord.php

    public static function findIdentity($id)
    {
        return static::findOne($id);
---
SELECT * FROM `user` WHERE `id`=3